{
  "id": "09d471cd-b71a-4772-be82-01a11c188318",
  "title": "How Expel Cut ML Monitoring Time by 50% with Arthur",
  "content": "Executive Guide to Successfully Innovating with AI Agents\n\nExpel partners with Arthur to transform ML performance, turning Faster Insights into Faster Detection\n\nExpel, needed a scalable way for its analyst to monitor its growing portfolio of machine learning models. Custom-built, manual monitoring systems were draining engineering resources and leading to inconsistent performance tracking for the cybersecurity experts who review, investigate, and triage alerts from customer environments to identify real world threats.\n\nThis means high stakes and tight timelines — where latency and model reliability are crucial. As a managed detection and response (MDR) provider, Expel monitors customer environments for cybersecurity threats and helps customers respond fast.\n\nBy adopting Arthur, Expel replaced fragmented tools with a centralized observability platform —cutting monitoring time by 50%, standardizing workflows, and reducing time wasted on false positives.\n\nArthur now powers real-time alerting, drift detection, and performance metrics across all models, giving Expelconfidence in model reliabilityand freeing up engineers to focus on innovation.\n\nWith Expel’s reliance on ML to score alerts and reduce analyst workload, robust MLOps is the backbone for ensuring fast deployment, retraining, monitoring, and governance of those models.\n\nWith Arthur, observability has become a strategic advantage — improving analyst efficiency, model trust, and the company’s ability to scale ML responsibly.\n\nExpel’s machine learning models were growing in number and importance, but its internal monitoring systems weren’t built to scale with that growth. Each model required its own custom-built monitoring setup — often built and maintained manually. Analysts serve as the human-in-the-loop, making critical decisions based on insights generated by Expel's detection and response platform. Over time, these one-off solutions becamecostly to maintain, difficult to standardize, and inconsistent in surfacing performance issues.\n\nThis fragmentation meant performance issues could go unnoticed, alerts were hard to trust, and the burden of upkeep was pulling valuable engineering time away from higher-impact projects. Expel needed a solution that could unify and simplify its approach to observability — one that was flexible, scalable, and easy to operationalize.\n\nThe speed and accuracy of ML-driven insights directly impact an analyst’s ability to act quickly on real threats. Well-managed MLOps ensures models stay performant and trustworthy, helping analysts focus on threats that matter rather than noise.\n\nAdopting Arthur gave Expel the scalable, centralized observability layer it was missing.  What was once a patchwork of tools and processes is now a single platform that handles everything from drift detection and performance tracking to alerting and performance metrics — fully adaptable to Expel’s internal workflows.Prior to Arthur, Expel’s analysts often had to investigate alerts triggered by models that were degrading silently — or reacting too sensitively to edge-case data. With no reliable signal for drift or performance breakdown, false positives led to significant operational drag: wasted analyst time, longer decision cycles, and reduced trust in model output.\n\nWith Arthur, Expel can now confidently track model behavior in production, detect subtle shifts before they escalate, and adapt faster — meaning analysts only engage with alerts that actually merit attention.\n\nUltimately, observability isn't just about knowing whether models are up — it's about knowing whether they're right. That confidence directly translates to saved analyst hours, less friction in incident response, and reduced costs tied to inefficiencies in triage. Arthur has made model observability a multiplier — increasing engineering efficiency, analyst effectiveness, and model reliability across the board.\n\nArthur stood out for its ease of integration, intuitive platform design, and deep alignment with Expel’s needs — both out of the box and in ongoing collaboration.\n\nFrom day one, Arthur’s team engaged closely with Expel’s data scientists to tailor the platform to real-world workflows and model constraints. When unique monitoring requirements arose, Arthur didn’t just accommodate — they partnered, co-developing functionality that addressed Expel’s internal data environment and operational priorities.\n\nThisflexibilityandresponsiveness gave Expel confidencethat Arthur could not only meet today’s needs, but continue evolving with them as they grew.\n\nWith Arthur now fully integrated, Expel has a scalable foundation for ML observability that supports both internal and customer-facing systems.This was done in accordance with Expel’s security standards. Every new model, regardless of use case, can be onboarded quickly and monitored consistently — with full support for custom metrics, drift detection, and project-specific monitoring needs.\n\nThis shift has freed up Expel’s data scientists to focus on innovation, not infrastructure — while giving teams across the organization a reliable window into how models are performing day to day.\n\nIn the context of cybersecurity, even seconds can be the difference between catching an intrusion early or facing a breach. This platform shift directly enhances Expel’s ability to protect its customers at scale.\n\nArthur isn’t just helping Expel keep up — it's helping the company lead. With scalable observability now in place, Expel is positioned to build more, iterate faster, and deliver ML that performs — with the visibility to prove it.\n\nTurn Expel’s Wins into Your WinsTalk to a Specialistand discover how continuous evaluation can transform your machine learning strategy.\n\nSign up for our newsletter to get the latest Arthur news!",
  "snippet": "How Expel transformed threat detection using Arthur's strategic observability to unlock AI's true potential.",
  "source_url": "https://www.arthur.ai/blog/how-expel-cut-ml-monitoring-time-by-50-with-arthur",
  "author": "Unknown",
  "tags": [],
  "category": "General",
  "word_count": 830,
  "created_at": "2025-10-22T21:47:56.564154Z",
  "reading_time": 4,
  "metadata": {
    "extracted_from_url": true,
    "extraction_date": "2025-10-22T21:47:56.564170Z",
    "original_url": "https://www.arthur.ai/blog/how-expel-cut-ml-monitoring-time-by-50-with-arthur"
  }
}
